# Eleman İşlemleri

In [22]:
import numpy as np
import pandas as pd

In [23]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [24]:
sozluk = {'var1':s1, 'var2':s2, 'var3':s3}

In [25]:
sozluk

{'var1': array([6, 7, 9, 3, 0]),
 'var2': array([5, 5, 3, 1, 8]),
 'var3': array([7, 7, 0, 7, 8])}

In [26]:
df = pd.DataFrame(sozluk)

In [27]:
df

   var1  var2  var3
0     6     5     7
1     7     5     7
2     9     3     0
3     3     1     7
4     0     8     8

In [28]:
df[0:1]

   var1  var2  var3
0     6     5     7

In [29]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [30]:
df.index = ['a', 'b', 'c', 'd', 'e']

In [31]:
df

   var1  var2  var3
a     6     5     7
b     7     5     7
c     9     3     0
d     3     1     7
e     0     8     8

In [32]:
df['c':'e']

   var1  var2  var3
c     9     3     0
d     3     1     7
e     0     8     8

# Silme

In [33]:
df

   var1  var2  var3
a     6     5     7
b     7     5     7
c     9     3     0
d     3     1     7
e     0     8     8

In [34]:
df.drop('a', axis=0)

   var1  var2  var3
b     7     5     7
c     9     3     0
d     3     1     7
e     0     8     8

In [35]:
df

   var1  var2  var3
a     6     5     7
b     7     5     7
c     9     3     0
d     3     1     7
e     0     8     8

In [36]:
df.drop('a', axis=0, inplace=True)

In [37]:
df

   var1  var2  var3
b     7     5     7
c     9     3     0
d     3     1     7
e     0     8     8

# fancy

In [38]:
df.drop(['c', 'd'])

   var1  var2  var3
b     7     5     7
e     0     8     8

# degişkenler için

In [39]:
df

   var1  var2  var3
b     7     5     7
c     9     3     0
d     3     1     7
e     0     8     8

In [40]:
'var1' in df

True

In [41]:
l = ['var1', 'var4', 'var2']

In [42]:
for i in l:
    print(i in df)

True
False
True

In [43]:
df

   var1  var2  var3
b     7     5     7
c     9     3     0
d     3     1     7
e     0     8     8

In [48]:
df['var4'] = df['var1'] + df['var2']

In [49]:
df

   var1  var2  var3  var4
b     7     5     7    12
c     9     3     0    12
d     3     1     7     4
e     0     8     8     8

# Column silme

In [50]:
df

   var1  var2  var3  var4
b     7     5     7    12
c     9     3     0    12
d     3     1     7     4
e     0     8     8     8

In [51]:
df.drop('var4', axis=1)

   var1  var2  var3
b     7     5     7
c     9     3     0
d     3     1     7
e     0     8     8

In [52]:
df

   var1  var2  var3  var4
b     7     5     7    12
c     9     3     0    12
d     3     1     7     4
e     0     8     8     8

In [53]:
df.drop('var4', axis=1, inplace=True)

In [54]:
df

   var1  var2  var3
b     7     5     7
c     9     3     0
d     3     1     7
e     0     8     8

# fancy ile silme

In [55]:
l = ['var1', 'var2']

In [56]:
df.drop(l, axis=1)

   var3
b     7
c     0
d     7
e     8